System Info:
	Python version: 3.6.8 |Anaconda, Inc.| (default, Feb 21 2019, 18:30:04) [MSC v.1916 64 bit (AMD64)]
	TensorFlow version: 1.11.0
	Keras version: 2.1.6-tf

Training Info:
	Loss Function: mean_absolute_error
	Optimisation Method: Adam
	Learning Rate: 0.001
	Batch Size: 128
	Number of Epochs: 20

Training Results:
	Loss: 0.012672001583368559
	Rse: 0.16637291195227094
	Corr: 0.9687715772897529

Validation Results:
	Loss: 0.018220669042677353
	Rse: 0.26552744704508496
	Corr: 0.3445880789216485

Model Summary:
	__________________________________________________________________________________________________
	Layer (type)                    Output Shape         Param #     Connected to                     
	==================================================================================================
	input_1 (InputLayer)            (None, 168, 8)       0                                            
	__________________________________________________________________________________________________
	reshape (Reshape)               (None, 168, 8, 1)    0           input_1[0][0]                    
	__________________________________________________________________________________________________
	conv2d (Conv2D)                 (None, 163, 1, 100)  4900        reshape[0][0]                    
	__________________________________________________________________________________________________
	dropout (Dropout)               (None, 163, 1, 100)  0           conv2d[0][0]                     
	__________________________________________________________________________________________________
	reshape_1 (Reshape)             (None, 163, 100)     0           dropout[0][0]                    
	__________________________________________________________________________________________________
	gru (GRU)                       [(None, 100), (None, 60300       reshape_1[0][0]                  
	__________________________________________________________________________________________________
	pre_ar_trans (PreARTrans)       (None, 24)           0           input_1[0][0]                    
	__________________________________________________________________________________________________
	dropout_1 (Dropout)             (None, 100)          0           gru[0][1]                        
	__________________________________________________________________________________________________
	flatten_1 (Flatten)             (None, 24)           0           pre_ar_trans[0][0]               
	__________________________________________________________________________________________________
	flatten (Flatten)               (None, 100)          0           dropout_1[0][0]                  
	__________________________________________________________________________________________________
	dense_1 (Dense)                 (None, 1)            25          flatten_1[0][0]                  
	__________________________________________________________________________________________________
	dense (Dense)                   (None, 8)            808         flatten[0][0]                    
	__________________________________________________________________________________________________
	post_ar_trans (PostARTrans)     (None, 8)            0           dense_1[0][0]                    
	                                                                 input_1[0][0]                    
	__________________________________________________________________________________________________
	add (Add)                       (None, 8)            0           dense[0][0]                      
	                                                                 post_ar_trans[0][0]              
	==================================================================================================
	Total params: 66,033
	Trainable params: 66,033
	Non-trainable params: 0
	__________________________________________________________________________________________________
