System Info:
	Python version: 3.6.8 |Anaconda, Inc.| (default, Feb 21 2019, 18:30:04) [MSC v.1916 64 bit (AMD64)]
	TensorFlow version: 1.11.0
	Keras version: 2.1.6-tf

Training Info:
	Loss Function: mean_absolute_error
	Optimisation Method: Adam
	Learning Rate: 0.001
	Batch Size: 128
	Number of Epochs: 20

Training Results:
	Loss: 0.020078346200013412
	Rse: 0.25401924763212574
	Corr: 0.9293462832678014

Validation Results:
	Loss: 0.031400975379822914
	Rse: 0.4329732892463016
	Corr: 0.09468807309512564

Model Summary:
	__________________________________________________________________________________________________
	Layer (type)                    Output Shape         Param #     Connected to                     
	==================================================================================================
	input_1 (InputLayer)            (None, 168, 8)       0                                            
	__________________________________________________________________________________________________
	pre_skip_trans (PreSkipTrans)   (None, 7, 8)         0           input_1[0][0]                    
	__________________________________________________________________________________________________
	gru (GRU)                       [(None, 100), (None, 32700       input_1[0][0]                    
	__________________________________________________________________________________________________
	gru_1 (GRU)                     [(None, 5), (None, 5 210         pre_skip_trans[0][0]             
	__________________________________________________________________________________________________
	dropout (Dropout)               (None, 100)          0           gru[0][1]                        
	__________________________________________________________________________________________________
	post_skip_trans (PostSkipTrans) (None, 115)          0           gru_1[0][1]                      
	                                                                 input_1[0][0]                    
	__________________________________________________________________________________________________
	pre_ar_trans (PreARTrans)       (None, 24)           0           input_1[0][0]                    
	__________________________________________________________________________________________________
	concatenate (Concatenate)       (None, 215)          0           dropout[0][0]                    
	                                                                 post_skip_trans[0][0]            
	__________________________________________________________________________________________________
	flatten_1 (Flatten)             (None, 24)           0           pre_ar_trans[0][0]               
	__________________________________________________________________________________________________
	flatten (Flatten)               (None, 215)          0           concatenate[0][0]                
	__________________________________________________________________________________________________
	dense_1 (Dense)                 (None, 1)            25          flatten_1[0][0]                  
	__________________________________________________________________________________________________
	dense (Dense)                   (None, 8)            1728        flatten[0][0]                    
	__________________________________________________________________________________________________
	post_ar_trans (PostARTrans)     (None, 8)            0           dense_1[0][0]                    
	                                                                 input_1[0][0]                    
	__________________________________________________________________________________________________
	add (Add)                       (None, 8)            0           dense[0][0]                      
	                                                                 post_ar_trans[0][0]              
	==================================================================================================
	Total params: 34,663
	Trainable params: 34,663
	Non-trainable params: 0
	__________________________________________________________________________________________________
