System Info:
	Python version: 3.6.8 |Anaconda, Inc.| (default, Feb 21 2019, 18:30:04) [MSC v.1916 64 bit (AMD64)]
	TensorFlow version: 1.11.0
	Keras version: 2.1.6-tf

Training Info:
	Loss Function: mean_absolute_error
	Optimisation Method: Adam
	Learning Rate: 0.001
	Batch Size: 128
	Number of Epochs: 20

Training Results:
	Loss: 0.026408742549969968
	Rse: 0.44686280363517766
	Corr: 0.8729905678916643

Validation Results:
	Loss: 0.029016998809082584
	Rse: 0.47579999767025166
	Corr: 0.8696856103958517

Model Summary:
	__________________________________________________________________________________________________
	Layer (type)                    Output Shape         Param #     Connected to                     
	==================================================================================================
	input_1 (InputLayer)            (None, 168, 862)     0                                            
	__________________________________________________________________________________________________
	pre_skip_trans (PreSkipTrans)   (None, 7, 862)       0           input_1[0][0]                    
	__________________________________________________________________________________________________
	gru (GRU)                       [(None, 100), (None, 288900      input_1[0][0]                    
	__________________________________________________________________________________________________
	gru_1 (GRU)                     [(None, 5), (None, 5 13020       pre_skip_trans[0][0]             
	__________________________________________________________________________________________________
	dropout (Dropout)               (None, 100)          0           gru[0][1]                        
	__________________________________________________________________________________________________
	post_skip_trans (PostSkipTrans) (None, 115)          0           gru_1[0][1]                      
	                                                                 input_1[0][0]                    
	__________________________________________________________________________________________________
	pre_ar_trans (PreARTrans)       (None, 24)           0           input_1[0][0]                    
	__________________________________________________________________________________________________
	concatenate (Concatenate)       (None, 215)          0           dropout[0][0]                    
	                                                                 post_skip_trans[0][0]            
	__________________________________________________________________________________________________
	flatten_1 (Flatten)             (None, 24)           0           pre_ar_trans[0][0]               
	__________________________________________________________________________________________________
	flatten (Flatten)               (None, 215)          0           concatenate[0][0]                
	__________________________________________________________________________________________________
	dense_1 (Dense)                 (None, 1)            25          flatten_1[0][0]                  
	__________________________________________________________________________________________________
	dense (Dense)                   (None, 862)          186192      flatten[0][0]                    
	__________________________________________________________________________________________________
	post_ar_trans (PostARTrans)     (None, 862)          0           dense_1[0][0]                    
	                                                                 input_1[0][0]                    
	__________________________________________________________________________________________________
	add (Add)                       (None, 862)          0           dense[0][0]                      
	                                                                 post_ar_trans[0][0]              
	==================================================================================================
	Total params: 488,137
	Trainable params: 488,137
	Non-trainable params: 0
	__________________________________________________________________________________________________
