System Info:
	Python version: 3.6.8 |Anaconda, Inc.| (default, Feb 21 2019, 18:30:04) [MSC v.1916 64 bit (AMD64)]
	TensorFlow version: 1.11.0
	Keras version: 2.1.6-tf

Training Info:
	Loss Function: mean_absolute_error
	Optimisation Method: Adam
	Learning Rate: 0.001
	Batch Size: 128
	Number of Epochs: 20

Training Results:
	Loss: 0.04181636267378845
	Rse: 0.3277158450462472
	Corr: 0.9070529331043777

Validation Results:
	Loss: 0.054865852029485365
	Rse: 0.449025530333393
	Corr: nan

Model Summary:
	__________________________________________________________________________________________________
	Layer (type)                    Output Shape         Param #     Connected to                     
	==================================================================================================
	input_1 (InputLayer)            (None, 168, 321)     0                                            
	__________________________________________________________________________________________________
	reshape (Reshape)               (None, 168, 321, 1)  0           input_1[0][0]                    
	__________________________________________________________________________________________________
	conv2d (Conv2D)                 (None, 163, 1, 100)  192700      reshape[0][0]                    
	__________________________________________________________________________________________________
	dropout (Dropout)               (None, 163, 1, 100)  0           conv2d[0][0]                     
	__________________________________________________________________________________________________
	reshape_1 (Reshape)             (None, 163, 100)     0           dropout[0][0]                    
	__________________________________________________________________________________________________
	pre_skip_trans (PreSkipTrans)   (None, 7, 100)       0           reshape_1[0][0]                  
	__________________________________________________________________________________________________
	gru (GRU)                       [(None, 100), (None, 60300       reshape_1[0][0]                  
	__________________________________________________________________________________________________
	gru_1 (GRU)                     [(None, 5), (None, 5 1590        pre_skip_trans[0][0]             
	__________________________________________________________________________________________________
	dropout_1 (Dropout)             (None, 100)          0           gru[0][1]                        
	__________________________________________________________________________________________________
	post_skip_trans (PostSkipTrans) (None, 115)          0           gru_1[0][1]                      
	                                                                 input_1[0][0]                    
	__________________________________________________________________________________________________
	concatenate (Concatenate)       (None, 215)          0           dropout_1[0][0]                  
	                                                                 post_skip_trans[0][0]            
	__________________________________________________________________________________________________
	flatten (Flatten)               (None, 215)          0           concatenate[0][0]                
	__________________________________________________________________________________________________
	dense (Dense)                   (None, 321)          69336       flatten[0][0]                    
	==================================================================================================
	Total params: 323,926
	Trainable params: 323,926
	Non-trainable params: 0
	__________________________________________________________________________________________________
